CSI API ETABS v1
cLinkObj.SetGUID Method
 Sets the GUID for the specified link object. If the GUID is passed in as a blank string, the program automatically creates a GUID for the object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGUID(
	string Name,
	string GUID = ""
)
Function SetGUID (
	Name As String,
	Optional GUID As String = ""
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetGUID(Name, GUID)
int SetGUID(
	String^ Name,
	String^ GUID = L""
)
abstract SetGUID :
        Name : string *
        ?GUID : string
(* Defaults:
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
The name of an existing link object.
GUID (Optional)
Type: System.String
The GUID (Global Unique ID) for the specified link object.
Return Value
Type: Int32
Returns zero if the link object GUID is successfully set; otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim MyGUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'set GUID
       ret = SapModel.LinkObj.SetGUID(Name, New Guid().ToString)
   'get GUID
       ret = SapModel.LinkObj.GetGUID(Name, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace